 
&НаКлиенте
Процедура УстановитьДанныеВыбора(Данные, ВыбранноеЗначение)
	Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
	Данные.Должность = ВыбранноеЗначение.Должность;
	Если Данные.Свойство("ВидЗанимаемойДолжности") Тогда
		Данные.ВидЗанимаемойДолжности = ВыбранноеЗначение.ВидНазначения;
	КонецЕсли; 
КонецПроцедуры
 

&НаКлиенте
Процедура СнятиеСДолжностиДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.СнятиеСДолжности.ТекущиеДанные
		, Элемент
		, Новый Структура("Сотрудник,Период")
	);
КонецПроцедуры
&НаКлиенте
Процедура СнятиеСДолжностиДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСДолжностиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Элементы.СнятиеСДолжности.ТекущиеДанные
		, Элемент
		, Новый Структура("Должность,Период")
	);
КонецПроцедуры
&НаКлиенте
Процедура СнятиеСДолжностиСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСДолжностиДатаПриИзменении(Элемент)
	Данные = Элементы.СнятиеСДолжности.ТекущиеДанные;
	Данные.Должность = Неопределено;	
КонецПроцедуры
