&НаСервере
Процедура ФП_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если СтароеФизЛицо <> ТекущийОбъект.ФизическоеЛицо Тогда
		Если ЗначениеЗаполнено(СтароеФизЛицо) Тогда
			Сотрудник = СтароеФизЛицо.ПолучитьОбъект();
			Сотрудник.Пользователь = Справочники.Пользователи.ПустаяСсылка();
			Сотрудник.Записать();
		КонецЕсли; 
		Если ЗначениеЗаполнено(ТекущийОбъект.ФизическоеЛицо) Тогда
			Сотрудник = ТекущийОбъект.ФизическоеЛицо.ПолучитьОбъект();
			Сотрудник.Пользователь = ТекущийОбъект.Ссылка;
			Сотрудник.Записать();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ФП_ПриОткрытииПосле(Отказ)
	СтароеФизЛицо = Объект.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ФП_ФизическоеЛицоПриИзмененииПосле(Элемент)
	Объект.Подразделение = ПолучитьПодразделениеНаСервере(Объект.ФизическоеЛицо);
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеНаСервере(ФизЛицо)
	Возврат ФизЛицо.Должность.Владелец;
КонецФункции
 
