
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда
		
		СтандартнаяОбработка = Ложь;
		Данные = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(Данные.РодительскаяГруппировкаСтроки) Тогда
			Если Данные = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Результат = Новый Структура();
			 
			Результат.Вставить("Сотрудник", Данные.Сотрудник);
			Результат.Вставить("Должность", Данные.Должность);
			Если Данные.Свойство("Оклад") Тогда
				Результат.Вставить("Оклад", Данные.Оклад);
			КонецЕсли; 
			Результат.Вставить("ВидНазначения", Данные.ВидНазначения);
			Результат.Вставить("ЭтоТекущая", Данные.ЭтоТекущая);
			
			ОповеститьОВыборе(Результат);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выберите элемент, а не группу!";
			Сообщение.Сообщить(); 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтображатьОклад") И Параметры.ОтображатьОклад = Ложь Тогда
		Тест = Новый Структура("Оклад");
		ЗаполнитьЗначенияСвойств(Тест, Элементы);
		Если Тест.Оклад <> Неопределено Тогда
			Тест.Оклад.Видимость = Ложь;
		КонецЕсли; 
		Список.Параметры.УстановитьЗначениеПараметра("СОкладом", Ложь); 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("СОкладом", Истина); 
	КонецЕсли;
КонецПроцедуры
