
&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Объект
		, Элемент
		, Новый Структура("Сотрудник")
		, Новый Структура("ОтображатьОклад", Ложь)
	);
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		Объект.Должность = ВыбранноеЗначение.Должность; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьСтоимость(ИмяТаблицы)
	ТекСтрока = Элементы[ИмяТаблицы].ТекущиеДанные;
	ТекСтрока.Стоимость = ТекСтрока.Цена * ТекСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПосчитатьСтоимость("Товары");   
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПосчитатьСтоимость("Товары");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Пользователь.ФизическоеЛицо) Тогда
	//	Объект.Сотрудник = Пользователь.ФизическоеЛицо;
	//	Должность = Пользователь.ФизическоеЛицо.Должность;
	//	Объект.Должность = Должность;
	//КонецЕсли; 
	//Если ЗначениеЗаполнено(Объект.Должность) Тогда
	//	Элементы.Должность.СписокВыбора.Добавить(Объект.Должность);		
	//КонецЕсли;
	//Если ЗначениеЗаполнено(Пользователь.ФизическоеЛицо) Тогда
	//	Элементы.Сотрудник.Доступность = Ложь;
	//КонецЕсли;   
КонецПроцедуры
