
&НаКлиенте
Процедура УстановитьДанныеВыбора(Данные, ВыбранноеЗначение)
	Модифицированность = Истина;
	Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
	Данные.Должность = ВыбранноеЗначение.Должность;
	Данные.Размер    = ВыбранноеЗначение.Оклад;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Должность", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		УстановитьДанныеВыбора(Элементы.Начисления.ТекущиеДанные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Должность);
		УстановитьДанныеВыбора(Элементы.Начисления.ТекущиеДанные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРазмерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.Начисления.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник,Должность", Данные.ДатаНачала)
	);
КонецПроцедуры
&НаКлиенте
Процедура НачисленияРазмерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Оклад);
		Данные = Элементы.Начисления.ТекущиеДанные;
		УстановитьДанныеВыбора(Данные, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Должность", Объект.Дата)
		, Новый Структура("ОтображатьОклад", Ложь)
	);	
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДопСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.НачисленияДоп.ТекущиеДанные;
		Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
		Данные.Должность = ВыбранноеЗначение.Должность;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	ИнтерактивныеОперацииКлиент.ОткрытьФормуВыбораСотрудника(
		  Данные
		, Элемент
		, Новый Структура("Период,Сотрудник", Объект.Дата)
		, Новый Структура("ОтображатьОклад", Ложь)
	);	
КонецПроцедуры
&НаКлиенте
Процедура НачисленияДопДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Элемент.СписокВыбора.Очистить();
		Элемент.СписокВыбора.Добавить(ВыбранноеЗначение.Сотрудник);
		Данные = Элементы.НачисленияДоп.ТекущиеДанные;
		Данные.Сотрудник = ВыбранноеЗначение.Сотрудник;
		Данные.Должность = ВыбранноеЗначение.Должность;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаНачалаПриИзменении(Элемент)
	Элементы.Начисления.ТекущиеДанные.Размер = 0;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопВидНачисленияПриИзменении(Элемент)
	Данные = Элементы.НачисленияДоп.ТекущиеДанные;
	Если Данные.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Надбавка") Тогда
		Данные.Размер = 1;
		Элементы.НачисленияДопРазмер.Доступность = Ложь;
	ИначеЕсли Данные.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Премия") Тогда
		Данные.Размер = 0;
		Элементы.НачисленияДопРазмер.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопПриАктивизацииСтроки(Элемент)
	Элементы.НачисленияДопРазмер.Доступность = (
		Элементы.НачисленияДоп.ТекущиеДанные.ВидНачисления 
		<> 
		ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.Надбавка")
	);
КонецПроцедуры


