&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если СтарыйПользователь <> Объект.Пользователь Тогда
		Если ЗначениеЗаполнено(СтарыйПользователь)  Тогда
			ОбъектПользователь = СтарыйПользователь.ПолучитьОбъект();
			ОбъектПользователь.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			ОбъектПользователь.Подразделение = Справочники.Подразделения.ПустаяСсылка();
			ОбъектПользователь.Записать();
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
			ОбъектПользователь = Объект.Пользователь.ПолучитьОбъект();
			ОбъектПользователь.ФизическоеЛицо = Объект.Ссылка;
			ОбъектПользователь.Подразделение = Объект.Должность.Владелец;
			ОбъектПользователь.Записать();
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтарыйПользователь = Объект.Пользователь;
КонецПроцедуры
